tienbk1995/STM32F407DISC/stm32f407GDisc_drivers/Src/togglebutton_main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include <stm32f407xx.h>
#include "software_delay.h"

#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

void EXTI0_IRQHandler(void)
{
	GPIO_IRQHandling(0);
}

int main(void)
{
	GPIO_Handle_t button;
	GPIO_Handle_t LD3;

	GPIO_Config(&LD3, GPIOD, GPIO_PIN_NO_12, GPIO_MODE_OUT, GPIO_SPEED_FAST, GPIO_OP_TYPE_PP, GPIO_NO_PUPD, 0);
	GPIO_Config(&button, GPIOA, GPIO_PIN_NO_0, GPIO_MODE_IN, GPIO_SPEED_FAST, GPIO_OP_TYPE_OD, GPIO_NO_PUPD, 0);

	GPIO_PeriClockControl(LD3.pGPIOx, ENABLE);
	GPIO_PeriClockControl(button.pGPIOx, ENABLE);

	GPIO_Init(&button);
	GPIO_Init(&LD3);


    /* Loop forever */
	while(1)
	{
		if (GPIO_ReadFromInputPin(button.pGPIOx, button.GPIO_PinConfig.GPIO_PinNumber) == 1)  //pressed
		{
			SoftwareDelay(5000);
			GPIO_ToggleOutputPin(LD3.pGPIOx, LD3.GPIO_PinConfig.GPIO_PinNumber);
		}
	}
}
